### Terraform Plan 📜
```
[command]/home/runner/work/_temp/8937f8f5-25e2-4b68-af0d-0304853d0d38/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.web must be replaced
-/+ resource "aws_instance" "web" {
      ~ arn                                  = "arn:aws:ec2:eu-north-1:713201898775:instance/i-09e147c3c46d08b03" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "eu-north-1a" -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-09e147c3c46d08b03" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-014a8f2c44621fe6c" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-92.eu-north-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.92" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "DevOps Project"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-01b693649eaadeb8e",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - primary_network_interface {
          - delete_on_termination = true -> null
          - network_interface_id  = "eni-014a8f2c44621fe6c" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-041892fb7d5267359" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # aws_security_group.instance_sg must be replaced
-/+ resource "aws_security_group" "instance_sg" {
      ~ arn                    = "arn:aws:ec2:eu-north-1:713201898775:security-group/sg-01b693649eaadeb8e" -> (known after apply)
      ~ description            = "Allow SSH and HTTP" -> "Allow SSH, HTTP, and app ports" # forces replacement
      ~ id                     = "sg-01b693649eaadeb8e" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 3001
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 3001
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 9090
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 9090
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 9100
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 9100
            },
            # (4 unchanged elements hidden)
        ]
        name                   = "instance_sg"
      + name_prefix            = (known after apply)
      ~ owner_id               = "713201898775" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_repository.Deepak will be updated in-place
  ~ resource "github_repository" "Deepak" {
      - has_issues                  = true -> null
        id                          = "DevOps-Project"
        name                        = "DevOps-Project"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.web must be replaced%0A-/+ resource "aws_instance" "web" {%0A      ~ arn                                  = "arn:aws:ec2:eu-north-1:713201898775:instance/i-09e147c3c46d08b03" -> (known after apply)%0A      ~ associate_public_ip_address          = false -> true # forces replacement%0A      ~ availability_zone                    = "eu-north-1a" -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      + enable_primary_ipv6                  = (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-09e147c3c46d08b03" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "stopped" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      + placement_group_id                   = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-014a8f2c44621fe6c" -> (known after apply)%0A      ~ private_dns                          = "ip-10-0-1-92.eu-north-1.compute.internal" -> (known after apply)%0A      ~ private_ip                           = "10.0.1.92" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [] -> (known after apply)%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "Name" = "DevOps Project"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-01b693649eaadeb8e",%0A        ] -> (known after apply)%0A        # (10 unchanged attributes hidden)%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - cpu_options {%0A          - core_count       = 1 -> null%0A          - threads_per_core = 2 -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "unlimited" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_protocol_ipv6          = "disabled" -> null%0A          - http_put_response_hop_limit = 2 -> null%0A          - http_tokens                 = "required" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - primary_network_interface {%0A          - delete_on_termination = true -> null%0A          - network_interface_id  = "eni-014a8f2c44621fe6c" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = false -> null%0A          - iops                  = 3000 -> null%0A          - tags                  = {} -> null%0A          - tags_all              = {} -> null%0A          - throughput            = 125 -> null%0A          - volume_id             = "vol-041892fb7d5267359" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp3" -> null%0A        }%0A    }%0A%0A  # aws_security_group.instance_sg must be replaced%0A-/+ resource "aws_security_group" "instance_sg" {%0A      ~ arn                    = "arn:aws:ec2:eu-north-1:713201898775:security-group/sg-01b693649eaadeb8e" -> (known after apply)%0A      ~ description            = "Allow SSH and HTTP" -> "Allow SSH, HTTP, and app ports" # forces replacement%0A      ~ id                     = "sg-01b693649eaadeb8e" -> (known after apply)%0A      ~ ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 3001%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 3001%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 9090%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 9090%0A            },%0A          - {%0A              - cidr_blocks      = [%0A                  - "0.0.0.0/0",%0A                ]%0A              - description      = ""%0A              - from_port        = 9100%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 9100%0A            },%0A            # (4 unchanged elements hidden)%0A        ]%0A        name                   = "instance_sg"%0A      + name_prefix            = (known after apply)%0A      ~ owner_id               = "713201898775" -> (known after apply)%0A      - tags                   = {} -> null%0A      ~ tags_all               = {} -> (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # github_repository.Deepak will be updated in-place%0A  ~ resource "github_repository" "Deepak" {%0A      - has_issues                  = true -> null%0A        id                          = "DevOps-Project"%0A        name                        = "DevOps-Project"%0A        # (33 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0APlan: 2 to add, 1 to change, 2 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```